---
kind: property
id: P:Autodesk.Revit.DB.Rectangle.Right
source: html/f2d1315e-4e43-5b20-5387-58babc1fb3fa.htm
---
# Autodesk.Revit.DB.Rectangle.Right Property

The x-coordinate of the bottom-right corner of the rectangle.

## Syntax (C#)
```csharp
public int Right { get; set; }
```